struct dentry {
	unsigned int               d_flags;              /*     0     4 */
	seqcount_t                 d_seq;                /*     4     4 */
	struct hlist_bl_node d_hash;                     /*     8    16 */
	struct dentry *            d_parent;             /*    24     8 */
	struct qstr        d_name;                       /*    32    16 */
	struct inode *             d_inode;              /*    48     8 */
	unsigned char              d_iname[32];          /*    56    32 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
	struct lockref     d_lockref __attribute__((__aligned__(8))); /*    88     8 */
	const struct dentry_operations  * d_op;          /*    96     8 */
	struct super_block *       d_sb;                 /*   104     8 */
	long unsigned int          d_time;               /*   112     8 */
	void *                     d_fsdata;             /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	union {
		struct list_head d_lru;                  /*   128    16 */
		wait_queue_head_t * d_wait;              /*   128     8 */
	};                                               /*   128    16 */
	struct list_head   d_child;                      /*   144    16 */
	struct list_head   d_subdirs;                    /*   160    16 */
	union {
		struct hlist_node d_alias;               /*   176    16 */
		struct hlist_bl_node d_in_lookup_hash;   /*   176    16 */
		struct callback_head d_rcu __attribute__((__aligned__(8))); /*   176    16 */
	} d_u __attribute__((__aligned__(8)));                                           /*   176    16 */

	/* size: 192, cachelines: 3, members: 16 */
	/* forced alignments: 2 */
} __attribute__((__aligned__(8)));
